{
  "basics": {
    "name": "Jayrell Allen Ballesteros",
    "label": "Student",
    "picture": "https://github.com/Kyj1n.png",
    "email": "jayrell@hawaii.edu",
    "phone": "808-367-4831",
    "website": "https://Kyj1n.github.io",
    "summary": "I am studying for a B.S. in Computer Science in the Department of Information and Computer Sciences at the University of Hawaii. I expect to graduate in Spring, 2025.",
    "location": { "address": "", "postalCode": "96782", "city": "Pearl City", "countryCode": "USA", "region": "Hawaii" },
    "profiles": [
      { "network": "github", "username": "Kyj1n", "url": "http://github.com/Kyj1n" },
      { "network": "linkedin", "username": "Jayrell Allen Ballesteros", "url": "www.linkedin.com/in/jayrell-allen-ballesteros-378390278" },
     
    ]
  },
  "interests": [
    { "name": "Software Engineering" },
    { "name": "Web Developing" },
    { "name": "UI/UX Design" }
  ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "keywords": [ "C", "C++", "Java", "Javascript", "Python" ]
    },
    {
      "name": "Toolsets/OS",
      "keywords": [ "MacOS", "Ubuntu", "Git/GitHub", "g++", "TI LaunchPad" ]
    }
  ],
  "education": [
    {
      "institution": "University of Hawaii, Honolulu, HI",
      "area": "Computer Science (expected to graduate by 2025)",
      "studyType": "B.S.",
      "startDate": "2020-08-24",
      "endDate": "Present",
      "courses": [
      ]
    }
  ],
  "work": [
    {
      "company": "Vector Marketing",
      "position": "Sales Associate",
      "website": "",
      "startDate": "2023-06",
      "endDate": "2023-08",
      "summary": "Embarking on a role as a Sales Associate with Vector Marketing and Cutco opens doors to a unique and rewarding experience in the world of direct sales. As an integral part of the team, you'll engage in direct marketing and sales of high-quality Cutco products. This role offers the chance to develop valuable sales and communication skills, work with a reputable brand, and earn competitive commissions.",
      "highlights": [
        "Networking: Develop networking skills by building relationships with clients and expanding your professional network.",
        "Direct Sales: Engage in direct marketing and sales efforts, presenting Cutco products to potential customers in a variety of settings."
      ]
    },
    {
      "company": "UNIQLO",
      "position": "Sales Associate",
      "website": "",
      "startDate": "2023-010",
      "endDate": "Present",
      "summary": "Being a Sales Associate at Uniqlo is a dynamic and customer-focused role where you'll contribute to providing an exceptional shopping experience. As a key member of the retail team, you'll engage with customers, assist them in finding the perfect products, and uphold Uniqlo's commitment to quality and service. This role offers an opportunity to be part of a global fashion brand, contributing to a vibrant and collaborative work environment.",
      "highlights": [
        "Customer Service: Provide outstanding customer service by assisting and advising shoppers on product selection and styling.",
        "Sales Goals: Work towards achieving individual and team sales targets through effective communication and product knowledge."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Aiea High School",
      "website": "https://www.aieahs.org/",
      "position": "Station Attendant",
      "startDate": "2016",
      "endDate": "2020",
      "summary": "As a dedicated volunteer, I actively contribute my time and skills to various community initiatives for my school and community. Passionate about making a positive impact, I engaged in activities that provided carnival game experiences to both students, families, and children.",
    },
  ],
  
  "references": [
    {
      "name": "Available upon request"
    }
  ]
}
